DECLARE X PIC INT.
DECLARE Y PIC INT.
DECLARE OK PIC BOOL.

MOVE 10 TO X.
MOVE 20 TO Y.
MOVE TRUE TO OK.

MOVE X + Y * 2 TO X.

IF X > 30 AND OK THEN
  MOVE Y - 1 TO Y.
END-IF.

PERFORM UNTIL Y >= 30
  MOVE Y + 2 TO Y.
END-PERFORM.
